# GetReferencingId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileReference..::..GetReferencingId Method
ExternalFileReference Class See Also
---
Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId GetReferencingId()
```

Visual Basic
---
```text
Public Function GetReferencingId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetReferencingId()
```

# See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace